import java.io.IOException;
import java.io.*;
import java.text.DecimalFormat;
import java.util.Scanner;
import java.util.stream.IntStream;

public class Razminka {
        public static void main(String[] args) {
        /*
Напишите программу на Java, чтобы добавить два двоичных числа. Перейти к редактору
Входные данные:
Введите первое двоичное число: 10
Введите второе двоичное число: 11
Ожидаемый результат

 Сумма двух двоичных чисел: 101
        */
        int a = 5;
        int b = 13;
                System.out.println(a + " " + b);

        int temp = a;
        a = b;
        b = temp;
                System.out.println(a + " " + b);




//                Scanner console = new Scanner(System.in);
//                System.out.println("введите первое число ");
//                Double num1 = console.nextDouble();
//                System.out.println("введите второе число ");
//                Double num2 = console.nextDouble();
//
//
//                System.out.print("Площадь " + num1 + " * " + num2 + " = ");
//                double value = num1*num2;
//                System.out.printf("%.2f", value);
//                System.out.println("Периметр 2 * (" + num1 + " + " + num2 + ") = " + 2*(num1+num2));

        }

}



